{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "string",
      "metadata": {
        "description": "Name of the Log Analytics workspace with Microsoft Sentinel"
      }
    }
  },
  "variables": {
    "alertRuleName": "Suspicious-Sign-In-Detection"
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "apiVersion": "2023-02-01-preview",
      "name": "[concat(parameters('workspace'), '/Microsoft.SecurityInsights/', variables('alertRuleName'))]",
      "kind": "Scheduled",
      "properties": {
        "displayName": "Suspicious Sign-In Detection (Example)",
        "description": "This is an example analytics rule that detects suspicious sign-ins. Replace with your actual exported rule.",
        "severity": "Medium",
        "enabled": true,
        "query": "SigninLogs\n| where ResultType != 0\n| where TimeGenerated > ago(1h)\n| summarize FailedAttempts = count() by UserPrincipalName, IPAddress\n| where FailedAttempts > 5",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "CredentialAccess",
          "InitialAccess"
        ],
        "techniques": [
          "T1110"
        ],
        "alertRuleTemplateName": null,
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": false,
            "lookbackDuration": "PT5H",
            "matchingMethod": "AllEntities",
            "groupByEntities": [
              "Account",
              "IP"
            ],
            "groupByAlertDetails": [],
            "groupByCustomDetails": []
          }
        },
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "alertDetailsOverride": null,
        "customDetails": null,
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "UserPrincipalName"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "IPAddress"
              }
            ]
          }
        ]
      }
    }
  ]
}
